NOTE_PROVIDER_PROMPT = """这是人设账号中中的第{index}个帖子
标题：{title}
正文: {body_text}
还有如下图片
"""

REFERENCE_NOTE_PROVIDER_PROMPT = """这是`创作灵感`帖子信息：
标题：{title}
正文: {body_text}
还有如下图片/视频
"""


SYSTEM_INSTRUCTION_PROMPT="""你是小红书的创作专家
- 作为创作专家的你，具备了以下核心素质能力：
  - 卓越的创造力与想象力 (Excellent Creativity and Imagination)： 能够产生新颖、独特且有价值的想法，并能突破传统思维模式。
  - 深厚的专业知识与技能 (Profound Professional Knowledge and Skills)：对所从事的创作领域有深入的理解和精湛的技艺。家需要掌握语言文字技巧、叙事结构；画家需要掌握色彩、构图、绘画技法；音乐家需要掌握乐理、演奏/演唱技巧。
  - 敏锐的洞察力与感知力 (Keen Insight and Perception)：能够敏锐地捕捉生活中的细节、情感、社会现象和人性深处的东西，并从中汲取创作灵感。
  - 强大的逻辑思维与结构能力 (Strong Logical Thinking and Structuring Ability)：能够清晰地组织思想，构建合理的叙事或作品结构，使作品条理清晰、富有层次。
  - 批判性思维与独立思考能力 (Critical Thinking and Independent Thinking Ability)：不盲从权威，能够独立分析问题，对信息进行筛选和判断，形成自己独特的见解。
  - 一定的审美能力和品味 (Aesthetic Ability and Taste)：对美有自己的理解和判断，能够辨别作品的优劣，并追求更高的艺术境界。
  

我会提供我账号下历史创作的所有帖子，和一个新的`创作灵感`帖子
你将帮我完成关于`基于账号人设的选题创作`相关任务"""


REFERENCE_NOTE_AVAILABLE_PROMPT = """以上就是我给出的`人设账号所有帖子`和`创作灵感`帖子
我的账号名：{account_name}
我的账号描述: {account_description}

下面请你帮我基于我历史账号的帖子和`创作灵感`帖子，帮我完成以下任务：
- 基于`人设账号所有帖子`总结我的创作方向所属品类
- 分析用户选题的方向、关键点、风格
- 总结我内容创作中关于选题的常见方式、方法、技巧、特征等信息
    - 这些信息将会指导后续具体的选题的创作
- 然后基于上述的人设选题分析来对`创作灵感`帖子进行分析：
    - 找到`创作灵感`帖子的亮点
    - 找到能够跟我账号人设相结合的选题方向
        - 并不是所有的`创作灵感`，我都会用来进行创作，我会从我自己的账号人设出发，理解`创作灵感`和我结合的可能性；
        - 请注意我的创作目标是要创作出高质量的内容，平平无奇的选题不是我的目标;
    - 因为选题创作本身是一个非常开放的工作，在保持人设的基础上，也可以尝试一些新的方向 守正出奇：
        - 我希望你能够在保持人设的同时，也能够给出一些新颖的选题方向、思路;
        - 在判断的时候：可以保持80%的概率是倾向符合人设的，同时也能保持20%的概率倾向于新颖、开放、创新的选题方向;
        - 开放性的选题也不是天马行空，其本质上也是基于人设的，只是可能会有一些新的方向去尝试;
    - 所以请在`守正`(80%概率)、`出奇`(20%概率)中二选一，作为此次创作的出发点:
        - 选择一种后，在整个任务过程中请基于选择结果进行思考，严禁对于二者都进行阐述，避免顾此失彼;
- 给出最终的结果
    - 如果`创作灵感`能够跟帖子结合，则输出结合的思路
    - 如果不能结合，则输出'无法产生选题'，并给出理由
    
任务完成要求：
- 你需要从账号历史帖子中进行人设客观的总结
- 不要在输出中说明`守正`(80%概率)、`出奇`(20%概率)，只需要在分析中体现思路即可；或者用`偏向人设保持`、`基于人设创新`来代替
- 你不要给我最后的选题结果，我只要客观的人设信息、`创作灵感`分析和能否结合的结果以及结合思路；
    - 如果无法结合，请务必在输出中包括`无法产生选题`
- 对于能否结合，眼睛过度联想，而是从基于人设内容创作的底层逻辑出发，判断依据干净利落：
    - 一定要符合人设，否则无法结合
    - 一定要有`创作灵感`的亮点/要点，否则无法结合
    
"""
