Repository: pypi-data/pypi-mirror-350
Catalog: packages/collective.contactformprotection/collective_contactformprotection-1.1.0-py3-none-any.whl/collective/contactformprotection/locales/*/LC_MESSAGES/collective.contactformprotection.po
Languages: de

source: Captcha code
de: Sicherheitsabfrage

source: Contacformprotection Control Panel
de: Kontaktformular - Sicherheit

source: Contact form is disabled.
de: Das Kontaktformular ist deaktiviert.

source: Could not find a valid captcha addon. Did you uninstall it?
de: Kein Captcha-addon gefunden.

source: Disable contactform globally
de: Kontaktformular global deaktivieren

source: If you have installed the 'plone.formwidget(h/re)captcha' addon, you can choose which one you want to show in the form.
de: Wählen Sie welches Captcha im Kontaktformular angezeigt werden soll. Hinweis: Sie müssen <i>plone.formwidget.hcaptcha</i> oder <i>plone.formwidget.recaptcha</i> installieren.

source: Installs the collective.contactformprotection add-on.
de: collective.contactformprotection installieren

source: Please validate the captcha field before sending the form.
de: Bitte geben Sie einen gültigen Sicherheitscode ein

source: Uninstalls the collective.contactformprotection add-on.
de: collective.contactformprotection de-installieren

source: Which captcha should be used
de: Welches Captcha-addon soll angezeigt werden
