Repository: pypi-data/pypi-mirror-350
Catalog: packages/imio.actionspanel/imio.actionspanel-1.70.tar.gz/imio.actionspanel-1.70/src/imio/actionspanel/locales/*/LC_MESSAGES/imio.actionspanel.po
Languages: es

source: %s_done_descr
es: Estado del elemento cambiado.

source: Add an element
es: Añadir un elemento

source: Define for each object transition the optional corresponding view
es: Definir para cada transición de objeto la vista correspondiente opcional

source: Formatted like "portal_type" "." "transition name" "|" "view", like "Document.publish|" . The view can be empty
es: Formateado como "portal_type" "." "nombre transicion" "|" "view", como "Document.publish|" . La vista puede estar vacia

source: Internal validation error
es: Error en validación Interna

source: Item's position has changed.
es: La posición del elemento a cambiado.

source: The first part must contain one dot to separate the type and the transition: line ${i}, '${val}'
es: La primera parte debe contener un punto para separar el tipo y la transición: linea ${i}, '${val}'

source: The transition value '${val}' is set multiple times.
es: El valor de la transición '${val}' esta definido múltiples veces.

source: The value cannot contain space: line ${i}, '${val}'
es: El valor no puede contener espacio: linea ${i}, '${val}'

source: This portal_type doesn't exist: line ${i}, '${val}'
es: Este portal_type no existe: linea ${i}, '${val}'

source: This transition id isn't valid for the portal_type: line ${i}, '${val}'
es: El ID de la transición no es valido para el portal_type: linea ${i}, '${val}'

source: Transition value
es: Valor de transición

source: Transitions to confirm
es: Transiciones a confirmar

source: delete_confirm_message
es: ¿Estás seguro de que deseas eliminar permanentemente este elemento de la aplicación?

source: history.gif_icon_title
es: Historial del elemento

source: history_last_event_has_comment.gif_icon_title
es: Historial de elemento (se ingresó un comentario durante el último evento)

source: object_deleted
es: El elemento ha sido eliminado.

source: title_move_item_bottom
es: Descender el elemento hacia abajo a la última posición

source: title_move_item_down
es: Descender el elemento

source: title_move_item_top
es: Subir el elemento a la primera posición

source: title_move_item_up
es: Subir el elemento

source: workflow_confirm
es: ¿Estás seguro de que deseas confirmar la transición del flujo de trabajo ${transition_name} de este elemento? En caso afirmativo, puede ingresar un comentario a continuación (opcional) y hacer clic en el botón 'Guardar'.
