Repository: pypi-data/pypi-mirror-350
Catalog: packages/task-commit/task_commit-0.1.18.tar.gz/task_commit-0.1.18/task_commit/locale/*/LC_MESSAGES/messages.po
Languages: es, pt_br

source: Error executing command
es: Error al ejecutar el comando
pt_br: Erro ao executar o comando

source: Choose a language
es: Elige un idioma
pt_br: Escolha um idioma

source: Adding language
es: Agregando idioma
pt_br: Adicionando Idioma

source: Language already exists
es: El idioma ya existe
pt_br: Idioma já existe

source: No Python files found for extraction
es: No se encontraron archivos de Python para la extracción
pt_br: Nenhum arquivo Python encontrado para extração

source: Language added successfully!
es: ¡Idioma agregado con éxito!
pt_br: Idioma adicionada com sucesso!

source: Updating translations...
es: Actualizando traducciones...
pt_br: Atualizando traduções...

source: Python files found:
es: Archivos de Python encontrados:
pt_br: Arquivos Python encontrados:

source: Extracting strings to .pot file...
es: Extrayendo cadenas al archivo .pot...
pt_br: Extraindo strings para arquivo .pot...

source: Updating existing translations...
es: Actualizando traducciones existentes...
pt_br: Atualizando traduções existentes...

source: File not found:
es: Archivo no encontrado:
pt_br: Arquivo nao encontrado:

source: Creating a new
es: Creando un nuevo
pt_br: Criando um novo

source: Compiling .mo file...
es: Compilando archivo .mo...
pt_br: Copilando .mo file...

source: Translations updated successfully!
es: ¡Traducciones actualizadas con éxito!
pt_br: Traduções atualizadas com sucesso!

source: Invalid command
es: Comando inválido
pt_br: Comando inválido

source: No arguments provided
es: No se proporcionaron argumentos
pt_br: Nenhum argumento fornecido

source: Git user is required
es: Se requiere un usuario de Git
pt_br: Usuário do Git é obrigatório

source: Error getting user from Git
es: Error al obtener el usuario de Git

source: Error checking Git status
es: Error al verificar el estado de Git
pt_br: Erro ao obter usuário do Git

source: Changes not staged
es: Cambios no preparados
pt_br: Mudanças não encenadas

source: Changes staged
es: Cambios preparados
pt_br: Mudanças não encenadas

source: Untracked files
es: Archivos sin seguimiento
pt_br: Arquivos não rastreados

source: Gitflow not installed, but push is successful
es: Gitflow no está instalado, pero el push fue exitoso
pt_br: Gitflow nao instalado, mas o push é realizado

source: Error getting current branch
es: Error al obtener la rama actual
pt_br: Erro ao obter branch atual

source: All changes added
es: Todos los cambios agregados
pt_br: Todas as mudanças adicionadas

source: Error adding changes
es: Error al agregar cambios
pt_br: Erro ao adicionar mudanças

source: Commit successful
es: Commit exitoso
pt_br: Commit realizado com sucesso

source: Error committing
es: Error al realizar el commit
pt_br: Erro ao realizar commit

source: Do you want to 'publish' or 'finish' this branch?
es: ¿Quieres 'publicar' o 'finalizar' esta rama?
pt_br: Deseja 'publish' ou 'finish' essa branch

source: Error publishing branch
es: Error al publicar la rama
pt_br: Erro ao publicar branch

source: Error finalizing branch
es: Error al finalizar la rama
pt_br: Erro ao finalizar branch

source: Invalid action
es: Acción inválida
pt_br: Ação inválida

source: Error when pushing
es: Error al hacer push
pt_br: Erro ao fazer push

source: .git/hooks directory not found. Please run inside a Git repository.
es: Directorio .git/hooks no encontrado. Por favor, ejecuta dentro de un repositorio Git.
pt_br: Diretório .git/hooks não encontrado. Por favor, execute dentro de um repositório Git.

source: Commit-msg hook successfully configured!
es: ¡Hook de commit-msg configurado con éxito!
pt_br: Hook Commit-msg configurado com sucesso!

source: y
es: s
pt_br: s

source: Starting commit process
es: Iniciando proceso de commit
pt_br: Iniciando processo de commit

source: No changes to commit
es: No hay cambios para confirmar
pt_br: Nenhuma mudança para commit

source: Do you want to add all changes
es: ¿Quieres agregar todos los cambios?
pt_br: Deseja adicionar todas as mudanças

source: Pulling latest changes...
es: Sacando los últimos cambios...
pt_br: Puxando as últimas alterações...

source: The current branch is not linked to a remote
es: La rama actual no está vinculada a una remota
pt_br: A ramificação atual não está vinculada a um remoto

source: Run the following command to configure the remote branch:
es: Ejecute el siguiente comando para configurar la rama remota:
pt_br: Execute o seguinte comando para configurar a ramificação remota:

source: Conflict or error when pulling!
es: �Conflicto o error al descargar cambios!
pt_br: Conflito ou erro ao baixar as mudanças!

source: Manually add the changes and run the command again
es: Agrega los cambios manualmente y ejecuta el comando nuevamente
pt_br: Adicione manualmente as mudanças e execute o comando novamente

source: Invalid option
es: Opción inválida
pt_br: Opção inválida

source: New functionality
es: Nueva funcionalidad
pt_br: Nova funcionalidade

source: Bug fix
es: Corrección de errores
pt_br: Correção de bug

source: Code refactoring
es: Refactorización de código
pt_br: Refatoração de código

source: Documentation update
es: Actualización de la documentación
pt_br: Atualização de documentação

source: Style changes
es: Cambios de estilo
pt_br: Alterações de estilo

source: Performance improvements
es: Mejoras de rendimiento
pt_br: Melhorias de desempenho

source: Test addition/correction
es: Adición/corrección de pruebas
pt_br: Teste de adição/correção

source: Configuration changes
es: Cambios de configuración
pt_br: Alterações de configuração

source: Changes in continuous integration
es: Cambios en la integración continua
pt_br: Alterações na integração contínua

source: Choose commit type
es: Elige el tipo de commit
pt_br: Escolha o tipo de commit

source: Invalid commit type
es: Tipo de commit inválido
pt_br: Tipo de commit inválido

source: Process interrupted. Exiting...
es: Proceso interrumpido. Saliendo...
pt_br: Processo interrompido. Saindo...

source: Unexpected error occurred
es: Ocurrió un error inesperado
pt_br: Erro inesperado ocorrido

source: Which module was changed? (example: core, api, models):
es: ¿Qué módulo fue cambiado? (ejemplo: core, api, models):
pt_br: Qual módulo foi alterado? (exemplo: core, api, models):

source: Module is mandatory
es: El módulo es obligatorio
pt_br: Módulo é obrigatório

source: Enter commit message
es: Ingresa el mensaje del commit
pt_br: Digite a mensagem do commit

source: Commit message is mandatory
es: El mensaje del commit es obligatorio
pt_br: Mensagem de commit é obrigatória

source: Error: Git username not set
es: Error: Nombre de usuario de Git no configurado
pt_br: Erro: Nome de usuário do Git não configurado

source: Do you want to send the commit
es: ¿Quieres enviar el commit?
pt_br: Deseja fazer commit para o repositório

source: Commit canceled
es: Commit cancelado
pt_br: Commit cancelado

source: Do you want to push to the repository
es: ¿Quieres hacer push al repositorio?
pt_br: Deseja fazer push para o repositório

source: Push canceled
es: Push cancelado
pt_br: Push cancelado

source: Leaving...
es: Saliendo...
pt_br: Saindo...

source: Unexpected error
es: Error inesperado
pt_br: Erro inesperado
