# -*- coding: UTF-8 -*-
from aitool import AutoPromptApp

manual_task = '生成一个属于赞美、祝福、正能量主题的短语。'
labeled_cases = [
    ('你如秋菊淡雅', '正例', '', ''),
    ('您的聪慧如星', '正例', '', ''),
    ('乐观拥抱新希望', '正例', '', ''),
    ('善良收获温暖回报', '正例', '', ''),
    ('拼搏奋进创佳绩', '正例', '', ''),
]
output_prompt = """依据【任务描述】生成数据。生成的多条数据之间用换行符分割。
【示例数据:】
努力拼搏铸辉煌
勇敢踏上新道路
坚定信念向前行
你如秋菊淡雅
拼搏奋进创佳绩
【任务描述:】
生成属于赞美、祝福、正能量主题的短语。要求表达简洁、直入主题、用词直接，并且口令的韵律感和节奏感强。
【生成的数据:】"""
generated_cases = [
    ('积极向上展锋芒', '', '', ''),
    ('勇往直前破万难', '', '', ''),
    ('努力奋斗展宏图', '', '', ''),
    ('拼搏进取创荣光', '', '', ''),
    ('乐观豁达福运长', '', '', ''),
    ('笑容绽放迎曙光', '', '', ''),
    ('积极乐观心敞亮', '', '', ''),
    ('你似春花芬芳', '', '', ''),
    ('祝福声声传好运', '', '', ''),
    ('祝福声声传四方', '', '', ''),
    ('奋斗不息志如钢', '', '', ''),
    ('善良之人天眷顾', '', '', ''),
    ('阳光总在风雨后', '', '', ''),
    ('善良之人福运长', '', '', ''),
    ('梦想点亮璀璨星', '', '', ''),
    ('乐观豁达迎暖阳', '', '', ''),
    ('阳光照耀希望路', '', '', ''),
    ('梦想起航破万浪', '', '', ''),
    ('心怀感恩岁月香', '', '', ''),
    ('心怀梦想志高昂', '', '', ''),
    ('心怀感恩福运长', '', '', ''),
    ('心怀希望迎曙光', '', '', ''),
    ('好运连连乐无疆', '', '', ''),
    ('奋斗书写壮丽篇', '', '', ''),
    ('勇敢逐梦展锋芒', '', '', ''),
    ('你似暖阳明亮', '', '', ''),
    ('勇往直前创荣光', '', '', ''),
    ('真诚待人爱满仓', '', '', ''),
    ('乐观积极好运长', '', '', ''),
    ('善良之人运道长', '', '', ''),
    ('乐观豁达心敞亮', '', '', ''),
    ('勇往直前展锋芒', '', '', ''),
    ('奋斗之路闪金光', '', '', ''),
    ('好运常伴福满堂', '', '', ''),
    ('你似夏荷韵清扬', '', '', ''),
    ('奋斗之路绽光芒', '', '', ''),
    ('你似暖阳暖心房', '', '', ''),
    ('祝福声声传吉祥', '', '', ''),
    ('乐观向上好运来', '', '', ''),
    ('心怀感恩福满盈', '', '', ''),
    ('勇往直前志如钢', '', '', ''),
    ('阳光照耀福满堂', '', '', ''),
    ('真爱相伴福满堂', '', '', ''),
    ('乐观豁达福满堂', '', '', ''),
    ('乐观进取创辉煌', '', '', ''),
    ('积极向上迎曙光', '', '', ''),
    ('真诚待人爱相伴', '', '', ''),
    ('勇往直前破万浪', '', '', ''),
    ('努力奋斗迎曙光', '', '', ''),
    ('奋斗路上展锋芒', '', '', ''),
]
inputs = []
time_estimate = 5
app = AutoPromptApp(labeled_cases, generated_cases, output_prompt, inputs, time_estimate)
app.run()
