Repository: pypi-data/pypi-mirror-350
Catalog: packages/aa-package-monitor/aa_package_monitor-2.2.2-py3-none-any.whl/package_monitor/locale/*/LC_MESSAGES/django.po
Languages: de, ru

source: not yet
de: Noch nicht
ru: пока нет

source: Last updated
de: Zuletzt aktualisiert
ru: Последнее обновление

source: Refresh data now
de: Daten jetzt aktualisieren
ru: Обновить данные

source: Refreshing distributions
de: Pakete aktualisieren
ru: Обновление дестрибутивов

source: Refreshing data for approx. %(all_count)s distributions...
de: Aktualisierung der Daten für ca. %(all_count)s Pakete...
ru: Обновление данных для приблизительно %(all_count)s дистрибутивов...

source: All
de: Alle
ru: Все

source: Current
de: Aktuell
ru: Текущий

source: Update available
de: Aktualisierung verfügbar
ru: Обновление доступно

source: No information about new release available on PyPI
de: Keine Informationen über neue Version auf PyPI verfügbar
ru: Нет данных о доступности нового релиза на PyPI

source: No Info
de: Keine Informationen
ru: Нет данных

source: Name of this distribution package
de: Name des Paketes
ru: Имя дистрибутива

source: Name
ru: Имя

source: Currently installed version of this package
de: Aktuell installierte Version des Paketes
ru: Текущая установленная версия пакета

source: Installed
de: Installiert
ru: Установлено

source: Latest available stable version compliant with all requirements for this package
de: Neueste verfügbare stabile Version, die alle Anforderungen für dieses Paket erfüllt
ru: Последняя доступная стабильная версия соотв. всем требованиям к пакету

source: Latest
de: Neueste
ru: Последний

source: Description
de: Beschreibung
ru: Описание

source: Currently installed Django apps included in this package
de: Derzeit installierte Django-Apps, die in diesem Paket enthalten sind
ru: Установленные Django-приложения включенные в пакет

source: Included Apps
de: Enthaltene Apps
ru: Включенные приложения

source: Other distribution packages that are using this package
de: Andere Pakete, die dieses Paket verwenden
ru: Другие дистрибутивы использующие этот пакет

source: Used By
de: Genutzt von
ru: Используемые

source: Shows all known distribution packages.
de: Zeige alle bekannten Pakete.
ru: Отображает все известные пакеты дистрибутивов.

source: Shows only distribution packages that contain an installed Django app.
de: Zeigt nur Pakete an, die eine installierte Django-App enthalten.
ru: Отображает только дистрибутивы, которые содержат установленное приложение Django.

source: In addition these packages are shown:
de: Zusätzlich werden diese Pakete angezeigt:
ru: В дополнение, отображаются пакеты:

source: The latest stable of a package is retrieved from PyPI. Will show as "?" if PyPI has no info about a package.
de: Der neueste Stable eines Pakets wird von PyPI abgerufen. Wird als "?" wenn PyPI keine Informationen über ein Paket hat.
ru: Последняя стабильная версия была получена от PyPI. В случае, если у PyPI нет данных о пакете, версия будет помечена как "?".

source: Command for installing all %(outdated_count)s outdated packages
de: Kommando zur Installation aller %(outdated_count)s veralteten Pakete
ru: Команда на установку всех %(outdated_count)s устаревших пакетов

source: No outdated packages to install.
de: Keine veralteten Pakete zu installieren.
ru: Нет устаревших пакетов к установке.

source: Distribution packages
de: Pakete
ru: Пакеты дистрибутивов
